---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.TrussFailures.InvalidWorkplaneForStructuralFraming
source: html/09068ede-0610-41c7-bc37-e71be67c6bc3.htm
---
# Autodesk.Revit.DB.BuiltInFailures.TrussFailures.InvalidWorkplaneForStructuralFraming Property

Workplane not valid for Structural Framing component "[Family Name]"

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidWorkplaneForStructuralFraming { get; }
```